<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"3fd6e6910f43a9ad4dcc2660ee0d51e59eca136669b8cb271bc4d6f73b7a021a","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1480 at https://github.com/cal-itp/data-infra/actions/runs/22196438639","plan_out_hash":"141b9b41ecf0fe75cd63e803260f74d79c416a74cbd459cc1e9d31d07ab381b6","plan_hash":"1f44d121286e1e03caa1ba4250f1dd42713e240e12857e6b317cdd4489c21983","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "HDpn3w==" -> (known after apply)
!~      detect_md5hash      = "7Wps/ksjYTaq7IQizaDKAA==" -> "different hash"
!~      generation          = 1770171455627823 -> (known after apply)
        id                  = "calitp-composer-dags/README.md"
!~      md5hash             = "7Wps/ksjYTaq7IQizaDKAA==" -> (known after apply)
        name                = "dags/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "1TPFVw==" -> (known after apply)
!~      detect_md5hash      = "oC2AyzffgaBgx5dupCEx3g==" -> "different hash"
!~      generation          = 1764100054442163 -> (known after apply)
        id                  = "calitp-composer-dags/download_gtfs_schedule_v2/METADATA.yml"
!~      md5hash             = "oC2AyzffgaBgx5dupCEx3g==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "6801vA==" -> (known after apply)
!~      detect_md5hash      = "+zQ2Z0BS6JZCYB46TbF18g==" -> "different hash"
!~      generation          = 1764100054822777 -> (known after apply)
        id                  = "calitp-composer-dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"
!~      md5hash             = "+zQ2Z0BS6JZCYB46TbF18g==" -> (known after apply)
        name                = "dags/unzip_and_validate_gtfs_schedule_hourly/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1480](https://github.com/cal-itp/data-infra/actions/runs/22196438639)